# GetCoordination Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryConnectorData..::..GetCoordination Method
PipeFittingAndAccessoryConnectorData Class See Also
---
Gets the coordination of the connector
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Transform GetCoordination()
```

Visual Basic
---
```text
Public Function GetCoordination As Transform
```

Visual C++
---
```text
public:
Transform^ GetCoordination()
```

# ### Return Value
The coordination of the connector
# See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace